{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features related to replacing and rendering the AVANTIA - W (2).png logo in the Hero section with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their functionality, styling, and recent fixes including the Hero section with the updated logo.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark mode CSS variables for the design system including primary, secondary, and sidebar colors.",
  "frontend/index.html": "HTML entry point with basic meta tags, title 'Avantia', and script reference to the React application mounted at #root.",
  "frontend/src/App.tsx": "Main React application component that renders the complete landing page structure including Hero, About, Services, WhyChoose, CTASection, Contact, Footer, and FloatingWhatsApp components.",
  "frontend/src/components/About.tsx": "About section component describing Avantia's Monterrey location and values (Strategy, Creativity, Growth, Results) with animated icon cards and gradient background.",
  "frontend/src/components/Contact.tsx": "Contact section with a comprehensive form (name, company, WhatsApp, email, message), direct WhatsApp button linking to 8124070421, contact information card, and social media links including Instagram.",
  "frontend/src/components/CTASection.tsx": "Call-to-action section with blue #004AAD background encouraging users to schedule a free consultation, featuring a prominent button that scrolls to the contact form.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right with green #25D366 background, pulse animation, and link to WhatsApp number 8124070421.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Avantia branding, Monterrey location, copyright notice, and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Hero section with solid #004AAD background featuring the AVANTIA - W (2).png logo, main headline, subtitle, two CTA buttons (strategy request and WhatsApp contact), and animated scroll indicator.",
  "frontend/src/components/Services.tsx": "Services section component displaying five marketing service cards (social media management, digital advertising, branding, web development, marketing strategies) with icons, titles, descriptions, and hover animations using Avantia's #004AAD brand color.",
  "frontend/src/components/WhyChoose.tsx": "WhyChoose section component showcasing four differentiators (personalized strategies, measurable results, direct attention, local market experience) with icons from lucide-react and animated cards in a responsive grid layout.",
  "frontend/src/hooks/useActor.ts": "React hook that manages Internet Computer actor creation using React Query, handling both authenticated and anonymous actors, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options for ICP integration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for Avantia's #004AAD brand, dark mode support, and custom animation utilities (fade-in, slide-in) for smooth page transitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component with necessary context providers.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color system using OKLCH, container settings, extended shadows, Inter font family, and accordion animations with typography and animate plugins.",
  "project_state.json": "Project metadata defining Avantia's landing page architecture, brand colors (#004AAD), contact information (WhatsApp: 8124070421), and completed features including hero, services, about, and contact sections."
}